benchmarks/phase2_batching.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /predict
Document Length:        46 bytes

Concurrency Level:      10
Time taken for tests:   3.792 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      19000 bytes
Total body sent:        17700
HTML transferred:       4600 bytes
Requests per second:    26.37 [#/sec] (mean)
Time per request:       379.179 [ms] (mean)
Time per request:       37.918 [ms] (mean, across all concurrent requests)
Transfer rate:          4.89 [Kbytes/sec] received
                        4.56 kb/s sent
                        9.45 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    95  255 189.1    184    1304
Waiting:       95  253 188.6    183    1302
Total:         95  255 189.1    184    1304

Percentage of the requests served within a certain time (ms)
  50%    184
  66%    238
  75%    261
  80%    352
  90%    555
  95%    666
  98%    815
  99%   1304
 100%   1304 (longest request)